Wiznet/ESP32_DevKit_SoM_MQTT_Failover/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 1 ms tick. TOE waits yield in 1-tick steps counted as milliseconds, so 100 Hz
# makes every such timeout run 10x long. NOTE: only reaches a freshly generated
# sdkconfig - update an existing one in menuconfig (FreeRTOS -> Kernel).
CONFIG_FREERTOS_HZ=1000

# --- wsm_driver ---
# Both backends work; switch in menuconfig (Component config -> WIZnet WSM
# Driver), no source change:
#   esp_eth MACRAW (default) - LwIP owns TCP/IP; full ESP-MQTT feature set.
#   TOE - chip owns TCP/IP; main/toe_socket_shim.c adds fcntl/select and the
#     failover routing. Plain mqtt:// + IP-literal broker only.
# Board (chip + pins) stays selectable there too; defaults to W5500-Dev-kit.
CONFIG_WSM_DRIVER_ENABLED=y
CONFIG_WSM_DRIVER_BACKEND_ETH=y
